{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_ids": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-ACT",
    "1": "B-ARTICLE",
    "2": "B-COURT",
    "3": "B-CRPC",
    "4": "B-DATE",
    "5": "B-IPC",
    "6": "B-MONEY",
    "7": "B-ORG",
    "8": "B-PARTY",
    "9": "B-SECTION",
    "10": "I-ACT",
    "11": "I-ARTICLE",
    "12": "I-COURT",
    "13": "I-CRPC",
    "14": "I-DATE",
    "15": "I-IPC",
    "16": "I-MONEY",
    "17": "I-ORG",
    "18": "I-PARTY",
    "19": "I-SECTION",
    "20": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ACT": 0,
    "B-ARTICLE": 1,
    "B-COURT": 2,
    "B-CRPC": 3,
    "B-DATE": 4,
    "B-IPC": 5,
    "B-MONEY": 6,
    "B-ORG": 7,
    "B-PARTY": 8,
    "B-SECTION": 9,
    "I-ACT": 10,
    "I-ARTICLE": 11,
    "I-COURT": 12,
    "I-CRPC": 13,
    "I-DATE": 14,
    "I-IPC": 15,
    "I-MONEY": 16,
    "I-ORG": 17,
    "I-PARTY": 18,
    "I-SECTION": 19,
    "O": 20
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
